In [2]:
#Regular dictionary within dictionary
SpotCrudePrices_2013_Data={
    'U.K. Brent' : {'2013-Q1':112.9, '2013-Q2':103.0, '2013-Q3':110.1, '2013-Q4':109.4},
    'Dubai':{'2013-Q1':108.1, '2013-Q2':100.8, '2013-Q3':106.1,'2013-Q4':106.7},
    'West Texas Intermediate':{'2013-Q1':94.4, '2013-Q2':94.2, '2013-Q3':105.8,'2013-Q4':97.4}}

In [3]:
import pandas as pd

In [7]:
#Create dataframe from dict of dict
dubaiPrices = pd.DataFrame.from_dict(SpotCrudePrices_2013_Data)

In [5]:
pd.DataFrame(SpotCrudePrices_2013_Data)

         Dubai  U.K. Brent  West Texas Intermediate
2013-Q1  108.1       112.9                     94.4
2013-Q2  100.8       103.0                     94.2
2013-Q3  106.1       110.1                    105.8
2013-Q4  106.7       109.4                     97.4

In [6]:
SpotCrudePrices_2013_Data

{'Dubai': {'2013-Q1': 108.1,
  '2013-Q2': 100.8,
  '2013-Q3': 106.1,
  '2013-Q4': 106.7},
 'U.K. Brent': {'2013-Q1': 112.9,
  '2013-Q2': 103.0,
  '2013-Q3': 110.1,
  '2013-Q4': 109.4},
 'West Texas Intermediate': {'2013-Q1': 94.4,
  '2013-Q2': 94.2,
  '2013-Q3': 105.8,
  '2013-Q4': 97.4}}

In [10]:
dubaiPrices[['Dubai']]

         Dubai
2013-Q1  108.1
2013-Q2  100.8
2013-Q3  106.1
2013-Q4  106.7

In [11]:
dubaiPrices.Dubai

2013-Q1    108.1
2013-Q2    100.8
2013-Q3    106.1
2013-Q4    106.7
Name: Dubai, dtype: float64

In [12]:
dubaiPrices.columns

Index(['Dubai', 'U.K. Brent', 'West Texas Intermediate'], dtype='object')

In [13]:
dubaiPrices.index

Index(['2013-Q1', '2013-Q2', '2013-Q3', '2013-Q4'], dtype='object')

In [16]:
#
dubaiPrices.describe()

            Dubai  U.K. Brent  West Texas Intermediate
count    4.000000    4.000000                 4.000000
mean   105.425000  108.850000                97.950000
std      3.195179    4.182902                 5.434151
min    100.800000  103.000000                94.200000
25%    104.775000  107.800000                94.350000
50%    106.400000  109.750000                95.900000
75%    107.050000  110.800000                99.500000
max    108.100000  112.900000               105.800000

In [17]:
dubaiPrices

         Dubai  U.K. Brent  West Texas Intermediate
2013-Q1  108.1       112.9                     94.4
2013-Q2  100.8       103.0                     94.2
2013-Q3  106.1       110.1                    105.8
2013-Q4  106.7       109.4                     97.4

In [18]:
#Changing col names
dubaiPrices.columns = ['Dubai','Brent','Texas']

In [19]:
dubaiPrices

         Dubai  Brent  Texas
2013-Q1  108.1  112.9   94.4
2013-Q2  100.8  103.0   94.2
2013-Q3  106.1  110.1  105.8
2013-Q4  106.7  109.4   97.4

In [28]:
#Get data by column index
dubaiPrices[[1,2]]

         Brent  Texas
2013-Q1  112.9   94.4
2013-Q2  103.0   94.2
2013-Q3  110.1  105.8
2013-Q4  109.4   97.4

In [32]:
import numpy as np
#Use arange to access elements
dubaiPrices[np.arange(1,3)]

         Brent  Texas
2013-Q1  112.9   94.4
2013-Q2  103.0   94.2
2013-Q3  110.1  105.8
2013-Q4  109.4   97.4

In [33]:
dubaiPrices[:2]

         Dubai  Brent  Texas
2013-Q1  108.1  112.9   94.4
2013-Q2  100.8  103.0   94.2

In [35]:
dubaiPrices[2:]

         Dubai  Brent  Texas
2013-Q3  106.1  110.1  105.8
2013-Q4  106.7  109.4   97.4

In [36]:
dubaiPrices[::-1]

         Dubai  Brent  Texas
2013-Q4  106.7  109.4   97.4
2013-Q3  106.1  110.1  105.8
2013-Q2  100.8  103.0   94.2
2013-Q1  108.1  112.9   94.4

In [38]:
dubaiPrices[np.arange(2,3)]

         Texas
2013-Q1   94.4
2013-Q2   94.2
2013-Q3  105.8
2013-Q4   97.4

In [39]:
NYC_SnowAvgsData={'Months' :
['January','February','March', 
'April', 'November', 'December'],
'Avg SnowDays' : [4.0,2.7,1.7,0.2,0.2,2.3],
'Avg Precip. (cm)' : [17.8,22.4,9.1,1.5,0.8,12.2],
'Avg Low Temp. (F)' : [27,29,35,45,42,32] }

In [46]:
NYC_SnowAvgs_index=pd.DataFrame(NYC_SnowAvgsData,  
                          index= NYC_SnowAvgsData['Months'], 
        columns = ['Avg SnowDays','Avg Precip. (cm)','Avg Low Temp. (F)'])

In [47]:
NYC_SnowAvgs_index

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January            4.0              17.8                 27
February           2.7              22.4                 29
March              1.7               9.1                 35
April              0.2               1.5                 45
November           0.2               0.8                 42
December           2.3              12.2                 32

In [48]:
NYC_SnowAvgs=pd.DataFrame(NYC_SnowAvgsData,  
                         # index= NYC_SnowAvgsData['Months'], 
        columns = ['Months','Avg SnowDays','Avg Precip. (cm)','Avg Low Temp. (F)'])

In [49]:
NYC_SnowAvgs

     Months  Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
0   January           4.0              17.8                 27
1  February           2.7              22.4                 29
2     March           1.7               9.1                 35
3     April           0.2               1.5                 45
4  November           0.2               0.8                 42
5  December           2.3              12.2                 32

In [50]:
NYC_SnowAvgs_index.loc['January']

Avg SnowDays          4.0
Avg Precip. (cm)     17.8
Avg Low Temp. (F)    27.0
Name: January, dtype: float64

In [51]:
NYC_SnowAvgs_index.loc[['January','April']]

         Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January           4.0              17.8                 27
April             0.2               1.5                 45

In [61]:
NYC_SnowAvgs_index.loc[:'April']

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January            4.0              17.8                 27
February           2.7              22.4                 29
March              1.7               9.1                 35
April              0.2               1.5                 45

In [65]:
NYC_SnowAvgs_index.iloc[1:4]

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
February           2.7              22.4                 29
March              1.7               9.1                 35
April              0.2               1.5                 45

In [71]:
#First element is row, next one is column
NYC_SnowAvgs_index.iloc[1:,:2]

          Avg SnowDays  Avg Precip. (cm)
February           2.7              22.4
March              1.7               9.1
April              0.2               1.5
November           0.2               0.8
December           2.3              12.2

In [68]:
NYC_SnowAvgs_index

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January            4.0              17.8                 27
February           2.7              22.4                 29
March              1.7               9.1                 35
April              0.2               1.5                 45
November           0.2               0.8                 42
December           2.3              12.2                 32

In [80]:
#Same index name being used
SnowAvgsData={'Months' :
['January','February','April', 
'April', 'November', 'December'],
'Avg SnowDays' : [4.0,2.7,1.7,0.2,0.2,2.3],
'Avg Precip. (cm)' : [17.8,22.4,9.1,1.5,0.8,12.2],
'Avg Low Temp. (F)' : [27,29,35,45,42,32] }

In [77]:
SnowAvgs_index=pd.DataFrame(SnowAvgsData,  
                          index= SnowAvgsData['Months'], 
        columns = ['Avg SnowDays','Avg Precip. (cm)','Avg Low Temp. (F)'])

In [78]:
SnowAvgs_index

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January            4.0              17.8                 27
February           2.7              22.4                 29
April              1.7               9.1                 35
April              0.2               1.5                 45
November           0.2               0.8                 42
December           2.3              12.2                 32

In [79]:
SnowAvgs_index.loc['April']

       Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
April           1.7               9.1                 35
April           0.2               1.5                 45